def num_to_str(n):
    w = []
    if n >= 100:
        w.append(["сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"][n//100-1])
        n = n%100
    if n >= 10:
        if n < 20:
            w.append(["десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"][n%10])
            n = 0
        else:
            w.append(["двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"][n//10-2])
            n = n%10
    if n >= 1:
        w.append(["один","два","три","четыре","пять","шесть","семь","восемь","девять"][n-1])
    if not w:
        w.append("ноль")
    return ' '.join(w)
print(num_to_str(110))
print(num_to_str(10))
print(num_to_str(0))